<a href="https://colab.research.google.com/github/zqiaohe/CupIT2020/blob/master/CupIT2020final.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [0]:
data = pd.read_csv('/content/drive/My Drive/CL_megafon_Cup IT_2020_final_data (1).csv', sep = ';')

In [0]:
data

                time_start  ... place_longitude
0      2019-08-24 14:23:56  ...      113.617867
1      2018-06-19 08:56:22  ...      113.617867
2      2018-08-29 14:00:32  ...      113.617867
3      2019-12-10 16:01:26  ...      113.617867
4      2019-12-10 13:39:42  ...      115.167583
...                    ...  ...             ...
78218  2018-06-25 11:25:04  ...      114.357402
78219  2018-04-06 10:07:13  ...      114.397573
78220  2018-07-13 22:59:34  ...      114.397573
78221  2018-11-06 00:05:57  ...      114.397573
78222  2018-10-15 02:24:15  ...      114.397573

[78223 rows x 4 columns]

In [0]:
 data.groupby(['place_latitude','place_longitude']).count()

                                time_start  time_end
place_latitude place_longitude
27.002889      115.390675               12        12
27.004426      114.508818                9         9
27.004441      114.482340               17        17
27.004443      115.305837                8         8
27.005625      114.930465               16        16
...                                    ...       ...
31.956940      114.472610               14        14
31.960560      112.951390                7         7
31.964470      111.010000               36        36
31.965556      113.599722               15        15
31.977074      115.393131                3         3

[8312 rows x 2 columns]

# Просто текст для проверки